In [1]:
import pandas as pd

In [2]:
employee = pd.DataFrame({
    'id': [101, 102, 103, 104, 105, 106],
    'name': ['John', 'Dan', 'James', 'Amy', 'Anne', 'Ron'],
    'department': ['A', 'A', 'A', 'A', 'A', 'B'],
    'managerId': [None, 101, 101, 101, 101, 101]
})

In [3]:
employee

    id   name department  managerId
0  101   John          A        NaN
1  102    Dan          A      101.0
2  103  James          A      101.0
3  104    Amy          A      101.0
4  105   Anne          A      101.0
5  106    Ron          B      101.0

In [10]:
df = employee.groupby(by='managerId').agg(e_cnt = ('id', 'count')).reset_index().merge(employee, how = 'inner', left_on= 'managerId', right_on= 'id', suffixes= ('_m', '_e'))

In [12]:
df[df['e_cnt'] >= 5][['name']]

   managerId_m  e_cnt   id  name department  managerId_e
0        101.0      5  101  John          A          NaN